#include <iostream>
#include <iomanip>
#include <cmath> //для корректного вывода
using namespace std;

int main()
{
	//создание и заполнение расширенной матрицы
	int m = 5, n = 6;
	float a[5][6] = { {-0.08 , -0.78 , -0.74 , -0.6  , -0.66 , -0.71 },
					  { 0.52 ,  0.12 ,  0.38 , -0.41 ,  0.42 ,  0.39 },
					  { 0.67 ,  0.57 ,  0.49 ,  0.7  ,  0.04 , -0.44 },
					  { 0.11 , -0.58 , -0.91 ,  0.44 ,  0.23 ,  0.6  },
					  {-0.33 , -0.13 ,  0.79 , -0.19 ,  0.2  ,  0.69 } };
	//основной цикл

	int mm = 0;

	for (int k = 0; k < m; k++)
	{
		//проверка условия а[k][k] > 0
		if (abs(a[k][k]) < 0.000001)
		{
			mm = k + 1;
			while ((abs(a[mm][k]) < 0.000001) && (mm < m))
			{
				mm += 1;
			};

			//перемена местами строк k и mm
			//идем по столбцам
			for (int j = 0; j < n; j++)
			{
				float temp;

				temp = a[k][j];
				a[k][j] = a[mm][j];
				a[mm][j] = temp;
			};
		};



		//применение правила прямоугольника
		for (int i = 0; i < m; i++)
			for (int j = k + 1; j < n; j++)
			{
				if (i != k)
					a[i][j] = (a[i][j] * a[k][k] - a[k][j] * a[i][k]) / a[k][k];
			}

		//обнуление элементов ведущего столбца
		for (int i = 0; i < m; i++)
		{
			if (i != k)
				a[i][k] = 0;
		}

		//деление ведущей строки на ведущий элемент
		for (int j = n - 1; j >= k; j--)
		{
			a[k][j] = a[k][j] / a[k][k];
		}

		//вывод результатов k-й итерации
		for (int i = 0; i <= m - 1; i++)
		{
			for (int j = 0; j <= n - 1; j++)
			{
				cout << setw(10) << round(a[i][j] * 100) / 100;
			}
			cout << endl;
		}
		cout << endl;
	}



}
